In [2]:
import pandas as pd
import numpy as np

In [3]:
nomi = ['Anna', 'Luca', 'Maria', 'Giovanni', 'Chiara', 'Francesco', 'Elena', 'Marco', 'Sara', 'Paolo']
città = ['Roma', 'Milano', 'Napoli', 'Torino', 'Palermo', 'Firenze', 'Bologna', 'Venezia', 'Genova', 'Verona']

In [6]:
dati = {
    "Nome": np.random.choice(nomi, 10),
    "Età": np.random.randint(10, 90, 10),
    "Città": np.random.choice(città, 10),
    "Salario": np.random.randint(20000, 80000, 10)
}
df = pd.DataFrame(dati)

In [7]:
df

        Nome  Età    Città  Salario
0       Anna   20  Palermo    47768
1      Paolo   39     Roma    37849
2      Maria   36  Firenze    58925
3  Francesco   61  Bologna    45056
4      Maria   47   Milano    65281
5      Marco   73  Firenze    75982
6       Sara   27   Napoli    66285
7      Maria   54   Genova    22090
8       Anna   27   Verona    40693
9       Anna   15  Venezia    25050

In [8]:
print(df.head())
print( df.tail())

        Nome  Età    Città  Salario
0       Anna   20  Palermo    47768
1      Paolo   39     Roma    37849
2      Maria   36  Firenze    58925
3  Francesco   61  Bologna    45056
4      Maria   47   Milano    65281
    Nome  Età    Città  Salario
5  Marco   73  Firenze    75982
6   Sara   27   Napoli    66285
7  Maria   54   Genova    22090
8   Anna   27   Verona    40693
9   Anna   15  Venezia    25050

In [9]:
print(df.dtypes)

Nome       object
Età         int32
Città      object
Salario     int32
dtype: object

In [10]:
statistiche = df.describe()
print(statistiche)
print("\nMediana Salario:", df['Salario'].median())

             Età       Salario
count  10.000000     10.000000
mean   39.900000  48497.900000
std    18.722832  17938.257381
min    15.000000  22090.000000
25%    27.000000  38560.000000
50%    37.500000  46412.000000
75%    52.250000  63692.000000
max    73.000000  75982.000000

Mediana Salario: 46412.0

In [11]:
duplicati = df.duplicated().sum()
print(duplicati)
df = df.drop_duplicates()

0

In [12]:
df.loc[np.random.choice(df.index, 2), 'Salario'] = np.nan
df['Salario'].fillna(df['Salario'].median(), inplace=True)

C:\Users\loren\AppData\Local\Temp\ipykernel_3464\788163543.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salario'].fillna(df['Salario'].median(), inplace=True)

In [13]:
df

        Nome  Età    Città  Salario
0       Anna   20  Palermo  47768.0
1      Paolo   39     Roma  37849.0
2      Maria   36  Firenze  46412.0
3  Francesco   61  Bologna  45056.0
4      Maria   47   Milano  65281.0
5      Marco   73  Firenze  75982.0
6       Sara   27   Napoli  66285.0
7      Maria   54   Genova  46412.0
8       Anna   27   Verona  40693.0
9       Anna   15  Venezia  25050.0

In [14]:
def classifica_età(età):
    if età <= 18:
        return "Giovane"
    elif età <= 65:
        return "Adulto"
    else:
        return "Senior"

df['Categoria Età'] = df['Età'].apply(classifica_età)

In [15]:
df.to_csv("dataset_pulito.csv", index=False)